package basicstudy;

public class VariableDemo {
    /*
     变量的概念：
        在程序执行的过程中，其值可以在某个范围内发生变化的值
        变量的本质，是内存中的一小块区域

      变量的定义和格式：
        数据类型 变量名 = 初始化值
        数据类型：变量变化的范围就是数据类型
        变量名：每个变量都有一个名字，方便存取
        初始化值：使用变量前，需要给变量赋值
     */
    /*
    数据类型的分类：
       基本数据类型：整数型：byte、short、int、long
                  字符型：char
                  浮点型：float、double
                  布尔型：boolean
       引用数据类型（了解）：类、接口、数组
    变量的作用域：只在它（定义的位置）所属的代码块内有效
         代码块：一对大括号范围内的代码，称为代码块
    变量定义和使用中的注意事项 ：
        1。变量未赋值，不能使用
        2。变量只在它所属的范围内有效
        3。一行上可以定义多个变量，但是不建议


     */
}
